using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace FairyZeta.Framework.Unit
{
    /// <summary> [基底] FZ／ユニット
    /// </summary>
    public abstract class _Unit
    {
      /*--- Property/Field Definitions ------------------------------------------------------------------------------------------------------------------------------*/

      /*--- Constructers --------------------------------------------------------------------------------------------------------------------------------------------*/

        /// <summary> [基底] FZ／ユニット／コンストラクタ
        /// </summary>
        public _Unit()
        {
            this.initUnit();
        }

      /*--- Method: Initialization ----------------------------------------------------------------------------------------------------------------------------------*/

        /// <summary> ユニットの初期化を実行します。
        /// </summary>
        /// <returns> 正常終了時 True </returns> 
        private bool initUnit()
        {
            return true;
        }

      /*--- Method: public ------------------------------------------------------------------------------------------------------------------------------------------*/

      /*--- Method: private -----------------------------------------------------------------------------------------------------------------------------------------*/

    }
}
